// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let x = [2,17,13,6,22,31,45,66,100,-18];
//     1. перебрати його циклом while
// i=0
// while (i < x.length){
//     console.log(x[i]);
//     i++
// }
    // 2. перебрати його циклом for
// for (i=0 ; i<x.length; i++){
//     console.log(x[i])
// }
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// i = 0;
// while (i < x.length){
//     if (i%2 !== 0){
//         console.log(x[i]);
//     }
//     i++
// }
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (i = 0; i < x.length; i++)
// if (i % 2 !==0){
//     console.log(x[i])
// }
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// i = 0;
// while (i < x.length ){
//     if (i%2  === 0){
//         console.log(x[i])
//     }
//     i++
// }
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (i=0; i< x.length; i++){
//     if ( i % 2 ===0){
//         console.log(x[i])
//     }
// }
// 7. замінити кожне число кратне 3 на слово "okten"

// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)