// --створити масив з:
//  - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let num = [ 5 , 6, 4, 10, 7,];
// let text= ['3', '5','2', '322','21'];
// let bools= [32, '44' , true, false,]
// console.log(num);
// console.log(text);
// console.log(bools);


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let num = [11,22,33,44,55 ];
// console.log(num[3]);


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i= 0 ;  i<10; i++) {
// document.write(`<div><p>Hello World</p></div>`)
// }
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0 ; i<10; i++) {
//     document.write(`<div>${i}<p>Hello World</p></div>`)
// }


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i = 0;
// while ( i < 20){
//     document.write(`<div><h1>Hello World</h1></div>`)
//     i++
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i = 0;
// while ( i < 20){
//     document.write(`<div>${i}<h1>Hello World</h1></div>`)
//     i++
// }


// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let num = [11,22,33,44,55,66,77,88,99,10]
// for (i = 0; i<num.length; i++ )
// {console.log(num[i])}

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let string = ['vasya', 'dima', 'lena','ira','sad','dsdsa','rerer','hghg','des'];
// for (i = 0 ; i<string.length; i++){
//     console.log(string[i])
// }
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи