//
// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
//
//  let a = +prompt('Введіть число ')
// let b = +prompt('Введіть число')
// if (a>b){
//  console.log(a)}
//  else if ( a === b){
//   console.log('Числа рівні' )
// }

//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let = entranceToTheApartment = +prompt('Введіть номер квартири ')
// if (entranceToTheApartment >0 && entranceToTheApartment <=20){
//  console.log('Квартира у першому підїзді')}
//
// else if (entranceToTheApartment>=21 && entranceToTheApartment <=48){
//  console.log('Квартира у другому підїзді')
// }
//  else if (entranceToTheApartment >= 49 && entranceToTheApartment <= 90){
//   console.log('Квартира у третьому підїзді')
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let namber = +prompt('Введіть число ')
// if (namber===10  ){
//  console.log('Вірно ')
// }
// else if (namber !==10 ){
//  console.log('Невірнор')
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = 23
// if (typeof x==="number"){
//     console.log('Це число')
// }
// else if (typeof x==='string'){
//     console.log('Це строка')
// }
// else if (typeof x==='boolean' ){
//     console.log('Це булеве значення ')
// }
// else if (typeof  x==='object'){
//     console.log('Це обєкт')
// }
// else {
//     console.log('wtf?')
// }
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
// let temp  = +prompt('Напишіть температуру ')
// if(temp >=10 && temp<=22){
//     console.log('Ми йдемо на навчання')
// }
// else {
//     console.log('сидимо вдома і вчимося ОНЛАЙН')
// }

//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let game = +prompt('Введіть чило від 1 до 5 ')
// switch (game){
//     case 1:
//         alert('Ви виграли автомобіль')
// break
//     case 2:
//         alert('Ви виграли мото')
//         break
//     case 3:
//         alert('Ви виграли телефон')
//         break
//     case 4:
//         alert('Ви виграли ноутбук')
//         break
//     case 5:
//         alert('Ви виграли кнгижку')
//         break
//     default:
//         alert('Вибачте ви програли ')
// }